In [60]:
import pandas as pd

raw = [
    {"date":"2026-01-01", "time":"09:10", "store":"A", "menu":"Americano", "price":"4,500원", "qty":"2", "paid":"TRUE"},
    {"date":"2026/01/01", "time":"09:12", "store":"A", "menu":"Latte",     "price":"5000",   "qty":1,   "paid":"True"}, # /
    {"date":"2026-01-02", "time":"12:30", "store":"A", "menu":"Latte",     "price":None,     "qty":2,   "paid":"FALSE"},
    {"date":"2026-01-03", "time":"18:05", "store":"B", "menu":"Mocha",     "price":"5500",   "qty":None,"paid":True},
    {"date":"2026-01-03", "time":"18:05", "store":"B", "menu":"Mocha",     "price":"5500",   "qty":None,"paid":True},  # 중복
    {"date":"2026-01-04", "time":"08:55", "store":"B", "menu":"Americano ", "price":"4500",  "qty":"1", "paid":"TRUE"}, # 공백
    {"date":"2026-01-04", "time":"08:58", "store":"A", "menu":"latte",     "price":"5,000",  "qty":"3", "paid":"TRUE"}, # 소문자
]
df = pd.DataFrame(raw)

df

         date   time store        menu   price   qty   paid
0  2026-01-01  09:10     A   Americano  4,500원     2   TRUE
1  2026/01/01  09:12     A       Latte    5000     1   True
2  2026-01-02  12:30     A       Latte    None     2  FALSE
3  2026-01-03  18:05     B       Mocha    5500  None   True
4  2026-01-03  18:05     B       Mocha    5500  None   True
5  2026-01-04  08:55     B  Americano     4500     1   TRUE
6  2026-01-04  08:58     A       latte   5,000     3   TRUE

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    7 non-null      object
 1   time    7 non-null      object
 2   store   7 non-null      object
 3   menu    7 non-null      object
 4   price   6 non-null      object
 5   qty     5 non-null      object
 6   paid    7 non-null      object
dtypes: object(7)
memory usage: 524.0+ bytes

In [62]:
df.shape

(7, 7)

In [63]:
df.describe(include="all")

              date   time store   menu price qty  paid
count            7      7     7      7     6   5     7
unique           5      6     2      5     5   5     4
top     2026-01-04  18:05     A  Latte  5500   2  TRUE
freq             2      2     4      2     2   1     3

In [64]:
df2=df.copy()
df2

         date   time store        menu   price   qty   paid
0  2026-01-01  09:10     A   Americano  4,500원     2   TRUE
1  2026/01/01  09:12     A       Latte    5000     1   True
2  2026-01-02  12:30     A       Latte    None     2  FALSE
3  2026-01-03  18:05     B       Mocha    5500  None   True
4  2026-01-03  18:05     B       Mocha    5500  None   True
5  2026-01-04  08:55     B  Americano     4500     1   TRUE
6  2026-01-04  08:58     A       latte   5,000     3   TRUE

In [85]:
df2["date"]=pd.to_datetime(df2["date"],errors='coerce',format='mixed')
df2["date"]

0   2026-01-01
1   2026-01-01
2   2026-01-02
3   2026-01-03
4   2026-01-03
5   2026-01-04
6   2026-01-04
Name: date, dtype: datetime64[ns]

In [86]:
df2["paid"] = df2["paid"].astype(str).str.strip().str.lower()
df2["paid"]

0     true
1     true
2    false
3     true
4     true
5     true
6     true
Name: paid, dtype: object

In [87]:
df2["price"] = (
    df2["price"]
    .astype("string")
    .str.replace("원", "", regex=False)
    .str.replace(",", "", regex=False)
)

df2["price"] = pd.to_numeric(df2["price"], errors="coerce")
df2["price"]

0    4500
1    5000
2    <NA>
3    5500
4    5500
5    4500
6    5000
Name: price, dtype: Int64

In [88]:
df2["qty"] = pd.to_numeric(df2["qty"], errors="coerce")
df2["qty"]

0    2.0
1    1.0
2    2.0
3    NaN
4    NaN
5    1.0
6    3.0
Name: qty, dtype: float64

In [89]:
df2["menu"] = df2["menu"].astype(str).str.strip().str.title()
df2["menu"]

0    Americano
1        Latte
2        Latte
3        Mocha
4        Mocha
5    Americano
6        Latte
Name: menu, dtype: object

In [90]:
# paid == True 만 인덱싱
cond_paid = df2["paid"].isin(["true"])
paid_df = df2[cond_paid]
paid_df

        date   time store       menu  price  qty  paid
0 2026-01-01  09:10     A  Americano   4500  2.0  true
1 2026-01-01  09:12     A      Latte   5000  1.0  true
3 2026-01-03  18:05     B      Mocha   5500  NaN  true
4 2026-01-03  18:05     B      Mocha   5500  NaN  true
5 2026-01-04  08:55     B  Americano   4500  1.0  true
6 2026-01-04  08:58     A      Latte   5000  3.0  true

In [91]:
cond_A = (df2["store"]=="A")
A_df = df2.loc[cond_A]
A_df

        date   time store       menu  price  qty   paid
0 2026-01-01  09:10     A  Americano   4500  2.0   true
1 2026-01-01  09:12     A      Latte   5000  1.0   true
2 2026-01-02  12:30     A      Latte   <NA>  2.0  false
6 2026-01-04  08:58     A      Latte   5000  3.0   true

In [92]:
cond_morning = df["time"].str.startswith("09")
mor_df=df2.loc[cond_morning]
mor_df

        date   time store       menu  price  qty  paid
0 2026-01-01  09:10     A  Americano   4500  2.0  true
1 2026-01-01  09:12     A      Latte   5000  1.0  true

In [93]:
paid_A_mor_df=df2.loc[cond_paid&cond_A&cond_morning, ["date","time","store","menu","price","qty","paid"]]
paid_A_mor_df

        date   time store       menu  price  qty  paid
0 2026-01-01  09:10     A  Americano   4500  2.0  true
1 2026-01-01  09:12     A      Latte   5000  1.0  true

In [95]:
paid_A_mor_df.to_csv("cafe_sales_clean_v1_assignment_김재천.csv", index=False, encoding="utf-8-sig")
assignment_df=pd.read_csv("cafe_sales_clean_v1_assignment_김재천.csv")
assignment_df

         date   time store       menu  price  qty  paid
0  2026-01-01  09:10     A  Americano   4500  2.0  True
1  2026-01-01  09:12     A      Latte   5000  1.0  True